Revit 2027 API
DocumentVersion.IsEqual Method
 Checks whether two DocumentVersions are identical. They are identical if both the GUID and number of saves are equal. If two DocumentVersions are identical, they come from the same document, with the same set of changes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	DocumentVersion other
)
Public Function IsEqual (
	other As DocumentVersion
) As Boolean
public:
bool IsEqual(
	DocumentVersion^ other
)
member IsEqual :
        other : DocumentVersion -> bool
Parameters
other DocumentVersion
 The DocumentVersion to compare to this DocumentVersion.
Return Value
Boolean
 True if the two DocumentVersions are equal. False otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DocumentVersion Class
Autodesk.Revit.DB Namespace